rico001/bambuddy-screen-4848S040CI-esp32/src/settings_screen.cpp
#include "settings_screen.h"

#include <Arduino.h>
#include <Preferences.h>
#include <WiFi.h>
#include <esp32_smartdisplay.h>
#include <string.h>
#include <time.h>

#include "bambuddy_config.h"
#include "screensaver.h"
#include "ui_layout.h"
#include "ui_theme.h"

// ============================================================
// Layout
// ============================================================
static constexpr int PAD = 12;
static constexpr int HEADER_H = 48;
static constexpr int ROW_H = 66;        // Touch-Ziel inkl. Untertitel
static constexpr int SLIDER_ROW_H = 96; // Titel oben, Slider darunter
static constexpr int EDIT_KB_H = 220;


// ============================================================
// Auswahllisten
// ============================================================

// Abfrageintervall waehrend eines Drucks. Im Leerlauf wird das Fuenffache
// verwendet (gedeckelt), da sich dort minutenlang nichts aendert.
static const uint32_t poll_intervals_ms[] = {1000, 2000, 5000, 10000, 30000};
static constexpr int POLL_COUNT = 5;
static constexpr int POLL_DEFAULT = 1; // 2 Sekunden
static constexpr uint32_t POLL_IDLE_MAX_MS = 30000;
static const char *poll_options = "1 Sekunde\n2 Sekunden\n5 Sekunden\n10 Sekunden\n30 Sekunden";

struct timezone_entry_t {
    const char *label;
    const char *posix;
};

// POSIX-Zeitzonen inklusive Sommerzeitregel — die Umstellung passiert damit
// automatisch, ohne dass das Geraet etwas nachladen muss.
static const timezone_entry_t timezones[] = {
    {"Berlin", "CET-1CEST,M3.5.0,M10.5.0/3"},
    {"London", "GMT0BST,M3.5.0/1,M10.5.0"},
    {"Athen", "EET-2EEST,M3.5.0/3,M10.5.0/4"},
    {"UTC", "UTC0"},
    {"New York", "EST5EDT,M3.2.0,M11.1.0"},
};
static constexpr int TZ_COUNT = 5;
static constexpr int TZ_DEFAULT = 0; // Berlin
static const char *tz_options = "Berlin\nLondon\nAthen\nUTC\nNew York";

// Bildschirmabschaltung. Standard sind fuenf Minuten: lange genug, dass das
// Display beim Vorbeigehen an bleibt, kurz genug, dass es nachts nicht die
// ganze Zeit leuchtet. 15 Sekunden vor dem Abschalten dunkelt es ab — so
// sieht man, dass gleich etwas passiert, und kann es antippen.
static const uint32_t screen_off_ms[] = {0, 30000, 60000, 300000, 600000};
static constexpr int SCREEN_OFF_COUNT = 5;
static constexpr int SCREEN_OFF_DEFAULT = 3; // 5 Minuten
static const char *screen_off_options =
    "Aus\n30 Sekunden\n1 Minute\n5 Minuten\n10 Minuten";

// Bildschirmschoner. "Aus" laesst das Display wie bisher dunkel werden,
// "Uhr" zeigt Uhrzeit und Druckerzustand, "Matrix" fallende Zeichen. Alles
// haengt an derselben
// Untaetigkeitsgrenze wie die Abschaltung — steht die auf "Aus", passiert
// gar nichts, und der Bildschirm bleibt dauerhaft an.
static constexpr int SAVER_COUNT = 3;
static constexpr int SAVER_DEFAULT = SCREENSAVER_OFF;
static const char *saver_options = "Aus\nUhr\nMatrix";

// Der Schoner leuchtet gedaempft: hell genug zum Ablesen aus dem Zimmer,
// dunkel genug, um nicht zu stoeren. Nachts noch einmal deutlich weniger —
// ein Wanddisplay, das um drei Uhr mit 30 Prozent ins Zimmer leuchtet, will
// niemand.
static constexpr float SAVER_BACKLIGHT = 0.30f;
static constexpr float SAVER_BACKLIGHT_NIGHT = 0.10f;
static constexpr int NIGHT_FROM_HOUR = 23;
static constexpr int NIGHT_TO_HOUR = 7;

// Zeit gilt als gueltig, wenn sie nach dem 15.11.2023 liegt —
// vorher steht die Uhr noch auf dem Startwert des Chips.
static constexpr time_t MIN_VALID_EPOCH = 1700000000;
static constexpr uint32_t NTP_RETRY_MS = 60000;

// ============================================================
// State
// ============================================================
static lv_obj_t *settings_list;
static lv_obj_t *dark_switch;
static lv_obj_t *tls_switch;
static lv_obj_t *guard_switch;
static lv_obj_t *poll_dd;
static lv_obj_t *tz_dd;
static lv_obj_t *brightness_slider;
static lv_obj_t *brightness_value_lbl;
static lv_obj_t *time_row_lbl;

// Dunkel ist Standard: Das Geraet haengt an der Wand, oft in einem Raum
// ohne Deckenlicht. Ein weisser 480x480-Bildschirm blendet dort.
static bool dark_mode = true;
static bool tls_verify = true;
// Standard: an. Ein versehentlicher Start am laufenden Drucker kostet im
// schlimmsten Fall ein Werkstueck und eine Duese — wer die Sperre nicht will,
// schaltet sie bewusst ab.
static bool start_guard = true;
static int brightness = 100;
static int poll_idx = POLL_DEFAULT;
static int tz_idx = TZ_DEFAULT;

// Vor dem Abschalten wird abgedunkelt: so sieht man es kommen und kann
// rechtzeitig tippen, statt ins Dunkle zu greifen.
static constexpr uint32_t DIM_LEAD_MS = 15000;
static constexpr float DIM_BACKLIGHT = 0.15f;

enum screen_level_t { SCREEN_ON, SCREEN_DIM, SCREEN_OFF };

static int screen_off_idx = SCREEN_OFF_DEFAULT;
static int saver_idx = SAVER_DEFAULT;
static screen_level_t screen_level = SCREEN_ON;
static lv_obj_t *sleep_catcher = nullptr;
static lv_timer_t *sleep_timer = nullptr;
static lv_obj_t *screen_off_dd;
static lv_obj_t *saver_dd;

static bool ntp_requested = false;
static uint32_t last_ntp_attempt_ms = 0;
static lv_timer_t *time_timer = nullptr;

static Preferences prefs;

// --- Textzeilen ---
#define MAX_TEXT_ROWS 16

struct text_row_t {
    const char *title;
    settings_get_fn get;
    settings_set_fn set;
    bool masked;
    bool numeric;
    lv_obj_t *value_lbl;
};

static text_row_t text_rows[MAX_TEXT_ROWS];
static int text_row_count = 0;

// --- Editor-Overlay ---
static lv_obj_t *edit_overlay = nullptr;
static lv_obj_t *edit_title;
static lv_obj_t *edit_ta;
static lv_obj_t *edit_kb;
static int edit_row_idx = -1;

// ============================================================
// Persistenz
// ============================================================

static void load_settings()
{
    prefs.begin("settings", true);
    dark_mode = prefs.getBool("dark", true);
    tls_verify = prefs.getBool("tls", true);
    start_guard = prefs.getBool("startguard", true);
    brightness = prefs.getInt("bright", 100);
    poll_idx = prefs.getInt("poll", POLL_DEFAULT);
    tz_idx = prefs.getInt("tz", TZ_DEFAULT);
    screen_off_idx = prefs.getInt("scroff", SCREEN_OFF_DEFAULT);
    saver_idx = prefs.getInt("saver", SAVER_DEFAULT);
    prefs.end();

