rico001/bambuddy-screen-4848S040CI-esp32/src/settings_screen.cpp
static void refresh_value_label(int idx)
{
    if (idx < 0 || idx >= text_row_count) return;

    text_row_t &row = text_rows[idx];
    char buf[64];
    format_value(row, buf, sizeof(buf));
    lv_label_set_text(row.value_lbl, buf);

    const char *value = row.get ? row.get() : "";
    const bool empty = (value == nullptr || value[0] == '\0');
    lv_obj_set_style_text_color(row.value_lbl,
                                lv_color_hex(empty ? COL_WARN : COL_MUTED), 0);
}

static void edit_close()
{
    edit_row_idx = -1;
    lv_obj_add_flag(edit_overlay, LV_OBJ_FLAG_HIDDEN);
}

static void edit_save_cb(lv_event_t *)
{
    if (edit_row_idx < 0) return;

    const int idx = edit_row_idx;
    text_row_t &row = text_rows[idx];
    if (row.set) row.set(lv_textarea_get_text(edit_ta));

    edit_close();
    refresh_value_label(idx);
}

static void edit_cancel_cb(lv_event_t *)
{
    edit_close();
}

static void edit_ta_cb(lv_event_t *e)
{
    const lv_event_code_t code = lv_event_get_code(e);
    if (code == LV_EVENT_READY) {
        edit_save_cb(e); // Haken auf der Tastatur = speichern
    } else if (code == LV_EVENT_CANCEL) {
        edit_close();
    }
}

// Overlay liegt auf lv_layer_top: immer ueber allen Screens, unabhaengig
// davon, welche Tileview-Kachel gerade sichtbar ist.
static void edit_overlay_create()
{
    edit_overlay = lv_obj_create(lv_layer_top());
    lv_obj_set_size(edit_overlay, SCREEN_W, SCREEN_H);
    lv_obj_align(edit_overlay, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_remove_flag(edit_overlay, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_style_radius(edit_overlay, 0, 0);
    lv_obj_set_style_border_width(edit_overlay, 0, 0);
    lv_obj_set_style_pad_all(edit_overlay, 0, 0);
    lv_obj_add_flag(edit_overlay, LV_OBJ_FLAG_HIDDEN);

    edit_title = lv_label_create(edit_overlay);
    lv_obj_set_style_text_font(edit_title, &lv_font_montserrat_16, 0);
    lv_obj_set_width(edit_title, SCREEN_W - 2 * PAD);
    lv_label_set_long_mode(edit_title, LV_LABEL_LONG_DOT);
    lv_obj_align(edit_title, LV_ALIGN_TOP_LEFT, PAD + 4, 18);

    edit_ta = lv_textarea_create(edit_overlay);
    lv_textarea_set_one_line(edit_ta, true);
    lv_obj_set_size(edit_ta, SCREEN_W - 2 * PAD, 52);
    lv_obj_align(edit_ta, LV_ALIGN_TOP_MID, 0, 56);
    lv_obj_add_event_cb(edit_ta, edit_ta_cb, LV_EVENT_READY, nullptr);
    lv_obj_add_event_cb(edit_ta, edit_ta_cb, LV_EVENT_CANCEL, nullptr);

    lv_obj_t *hint = lv_label_create(edit_overlay);
    lv_label_set_text(hint, "Wird sofort gespeichert.");
    lv_obj_set_style_text_font(hint, &lv_font_montserrat_12, 0);
    lv_obj_set_style_text_color(hint, lv_color_hex(COL_MUTED), 0);
    lv_obj_align(hint, LV_ALIGN_TOP_LEFT, PAD + 4, 116);

    lv_obj_t *cancel_btn = lv_button_create(edit_overlay);
    lv_obj_set_size(cancel_btn, 150, 46);
    lv_obj_align(cancel_btn, LV_ALIGN_TOP_LEFT, PAD, 146);
    lv_obj_set_style_bg_color(cancel_btn, lv_color_hex(COL_NEUTRAL), 0);
    lv_obj_add_event_cb(cancel_btn, edit_cancel_cb, LV_EVENT_CLICKED, nullptr);
    lv_obj_t *cancel_lbl = lv_label_create(cancel_btn);
    lv_label_set_text(cancel_lbl, LV_SYMBOL_CLOSE "  Abbrechen");
    lv_obj_center(cancel_lbl);

    lv_obj_t *save_btn = lv_button_create(edit_overlay);
    lv_obj_set_size(save_btn, SCREEN_W - 2 * PAD - 160, 46);
    lv_obj_align(save_btn, LV_ALIGN_TOP_RIGHT, -PAD, 146);
    lv_obj_set_style_bg_color(save_btn, lv_color_hex(COL_ACCENT), 0);
    lv_obj_add_event_cb(save_btn, edit_save_cb, LV_EVENT_CLICKED, nullptr);
    lv_obj_t *save_lbl = lv_label_create(save_btn);
    lv_label_set_text(save_lbl, LV_SYMBOL_SAVE "  Speichern");
    lv_obj_center(save_lbl);

    edit_kb = lv_keyboard_create(edit_overlay);
    lv_obj_set_size(edit_kb, SCREEN_W, EDIT_KB_H);
    lv_obj_align(edit_kb, LV_ALIGN_BOTTOM_MID, 0, 0);
    lv_keyboard_set_textarea(edit_kb, edit_ta);
}

static void edit_open(int idx)
{
    if (idx < 0 || idx >= text_row_count) return;
    if (!edit_overlay) edit_overlay_create();

    edit_row_idx = idx;
    const text_row_t &row = text_rows[idx];

    lv_label_set_text(edit_title, row.title);
    lv_keyboard_set_mode(edit_kb, row.numeric ? LV_KEYBOARD_MODE_NUMBER
                                              : LV_KEYBOARD_MODE_TEXT_LOWER);

    // Beim Bearbeiten immer im Klartext — sonst kann niemand pruefen,
    // ob der Key richtig angekommen ist.
    lv_textarea_set_text(edit_ta, row.get ? row.get() : "");

    lv_obj_remove_flag(edit_overlay, LV_OBJ_FLAG_HIDDEN);
    lv_obj_move_foreground(edit_overlay);
}

static void text_row_cb(lv_event_t *e)
{
    edit_open((int)(intptr_t)lv_event_get_user_data(e));
}

lv_obj_t *settings_add_text_row(const char *icon, const char *title,
                                settings_get_fn get, settings_set_fn set,
                                bool masked, bool numeric)
{
    if (text_row_count >= MAX_TEXT_ROWS) return nullptr;

    const int idx = text_row_count++;
    text_row_t &entry = text_rows[idx];
    entry.title = title;
    entry.get = get;
    entry.set = set;
    entry.masked = masked;
    entry.numeric = numeric;

    // Der Wert steht als Untertitel unter dem Namen — mehr Platz als eine
    // rechtsbuendige Spalte, und lange URLs bleiben lesbar.
    lv_obj_t *row = row_create(icon, title, "", &entry.value_lbl);
    lv_obj_add_flag(row, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_set_style_bg_color(row, lv_color_hex(COL_ACCENT), LV_STATE_PRESSED);
    lv_obj_add_event_cb(row, text_row_cb, LV_EVENT_CLICKED, (void *)(intptr_t)idx);

    // Chevron signalisiert: hier oeffnet sich etwas
    lv_obj_t *chevron = lv_label_create(row);
    lv_label_set_text(chevron, LV_SYMBOL_RIGHT);
    lv_obj_set_style_text_color(chevron, lv_color_hex(COL_MUTED), 0);
    lv_obj_set_style_pad_left(chevron, 10, 0);

    refresh_value_label(idx);
    return row;
}

// ============================================================
// NTP
// ============================================================

static void time_tick_cb(lv_timer_t *)
{
    const bool online = (WiFi.status() == WL_CONNECTED);
    const time_t now = time(nullptr);
    const bool valid = now >= MIN_VALID_EPOCH;

    if (online && !valid) {
        const uint32_t ms = millis();
        if (!ntp_requested || (ms - last_ntp_attempt_ms) >= NTP_RETRY_MS) {
            configTzTime(timezones[tz_idx].posix,
                         "de.pool.ntp.org", "pool.ntp.org", "time.nist.gov");
            ntp_requested = true;
            last_ntp_attempt_ms = ms;
            Serial.println("[Settings] NTP-Sync angefordert");
        }
    }

