rico001/bambuddy-screen-4848S040CI-esp32/src/settings_screen.cpp
    if (!time_row_lbl) return;

    if (valid) {
        struct tm local_tm;
        localtime_r(&now, &local_tm);
        char buf[48];
        strftime(buf, sizeof(buf), "%d.%m.%Y  %H:%M:%S", &local_tm);
        lv_label_set_text(time_row_lbl, buf);
        lv_obj_set_style_text_color(time_row_lbl, lv_color_hex(COL_OK), 0);
    } else {
        lv_label_set_text(time_row_lbl, online ? "Synchronisiere ..." : "Wartet auf WLAN");
        lv_obj_set_style_text_color(time_row_lbl, lv_color_hex(COL_MUTED), 0);
    }
}

// Uhr und Bildschirmabschaltung laufen unabhaengig davon, ob der
// Einstellungs-Screen jemals gebaut wurde — beide gehoeren zum Geraet,
// nicht zu einer Kachel.
static void start_background_services()
{
    if (!sleep_timer) {
        sleep_timer = lv_timer_create(sleep_check_cb, 500, nullptr);
        lv_timer_set_repeat_count(sleep_timer, -1);
    }

    if (!time_timer) {
        time_timer = lv_timer_create(time_tick_cb, 1000, nullptr);
        lv_timer_set_repeat_count(time_timer, -1);
    }
    time_tick_cb(nullptr);
}

// ============================================================
// Callbacks
// ============================================================

static void dark_switch_cb(lv_event_t *)
{
    dark_mode = lv_obj_has_state(dark_switch, LV_STATE_CHECKED);
    apply_theme();
    save_settings();
}

static void tls_switch_cb(lv_event_t *)
{
    tls_verify = lv_obj_has_state(tls_switch, LV_STATE_CHECKED);
    save_settings();
    Serial.printf("[Settings] TLS-Pruefung: %s\n", tls_verify ? "an" : "AUS");
}

static void brightness_cb(lv_event_t *)
{
    brightness = lv_slider_get_value(brightness_slider);
    screen_level = SCREEN_ON; // Regler bedienen heisst: Bildschirm ist wach
    apply_brightness();
    lv_label_set_text_fmt(brightness_value_lbl, "%d%%", 20 + brightness * 80 / 100);
    save_settings();
}

static void poll_dd_cb(lv_event_t *)
{
    poll_idx = lv_dropdown_get_selected(poll_dd);
    save_settings();
}

static void saver_dd_cb(lv_event_t *)
{
    saver_idx = (int)lv_dropdown_get_selected(saver_dd);
    save_settings();

    // Laeuft gerade ein Schoner und die Wahl aendert sich, sofort umstellen —
    // sonst bliebe der alte stehen, bis das naechste Mal geweckt wird.
    if (screensaver_visible()) {
        screensaver_show(screensaver_mode_available((screensaver_mode_t)saver_idx)
                             ? (screensaver_mode_t)saver_idx
                             : SCREENSAVER_OFF);
    }
}

static void guard_switch_cb(lv_event_t *)
{
    start_guard = lv_obj_has_state(guard_switch, LV_STATE_CHECKED);
    save_settings();
}

static void screen_off_dd_cb(lv_event_t *)
{
    screen_off_idx = lv_dropdown_get_selected(screen_off_dd);
    set_screen_level(SCREEN_ON);
    save_settings();
}

static void tz_dd_cb(lv_event_t *)
{
    tz_idx = lv_dropdown_get_selected(tz_dd);
    apply_timezone();
    save_settings();
    time_tick_cb(nullptr); // Anzeige sofort aktualisieren
}

// Zahlen als Text fuer die Textzeilen
static const char *printer_id_get()
{
    static char buf[8];
    snprintf(buf, sizeof(buf), "%d", bambuddy_printer_id());
    return buf;
}

static const char *mqtt_port_get()
{
    static char buf[8];
    snprintf(buf, sizeof(buf), "%d", bambuddy_mqtt_port());
    return buf;
}

static void source_switch_cb(lv_event_t *e)
{
    lv_obj_t *sw = (lv_obj_t *)lv_event_get_target(e);
    const bool use_mqtt = lv_obj_has_state(sw, LV_STATE_CHECKED);
    bambuddy_set_source_mqtt(use_mqtt);
    Serial.printf("[Settings] Statusquelle: %s\n", use_mqtt ? "MQTT" : "HTTP");
}

// ============================================================
// Public API
// ============================================================

void settings_apply_saved()
{
    load_settings();
    apply_theme();
    apply_brightness();
    apply_timezone();
    // Uhr und Bildschirmabschaltung gehoeren zum Geraet und duerfen nicht
    // vom spaeter nur bei Bedarf erzeugten Einstellungs-Screen abhaengen.
    start_background_services();
}

void settings_screen_create(lv_obj_t *parent)
{
    lv_obj_remove_flag(parent, LV_OBJ_FLAG_SCROLLABLE);

    // Scrollbare Liste — neue Einstellungen haengen sich unten an,
    // ohne dass Positionen angepasst werden muessen.
    settings_list = lv_obj_create(parent);
    lv_obj_set_size(settings_list, SCREEN_W - 2 * PAD, SCREEN_H - HEADER_H - PAD);
    lv_obj_align(settings_list, LV_ALIGN_TOP_MID, 0, HEADER_H);
    lv_obj_set_style_bg_opa(settings_list, LV_OPA_TRANSP, 0);
    lv_obj_set_style_border_width(settings_list, 0, 0);
    lv_obj_set_style_pad_all(settings_list, 0, 0);
    lv_obj_set_style_pad_row(settings_list, 8, 0);
    lv_obj_set_flex_flow(settings_list, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_scroll_dir(settings_list, LV_DIR_VER);

    // --- Darstellung ---
    //
    // Steht bewusst ganz oben: Helligkeit, Dark Mode und Bildschirmschoner
    // fasst man im Alltag am haeufigsten an. Server-URL und Schluessel
    // dagegen einmal beim Einrichten und danach nie wieder.
    settings_add_section("DARSTELLUNG");

    lv_obj_t *dark_row = settings_add_row(LV_SYMBOL_IMAGE, "Dark Mode",
                                          "Dunkles Farbschema fuer alle Screens");
    dark_switch = lv_switch_create(dark_row);
    lv_obj_set_size(dark_switch, 58, 32);
    if (dark_mode) lv_obj_add_state(dark_switch, LV_STATE_CHECKED);
    lv_obj_add_event_cb(dark_switch, dark_switch_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    lv_obj_t *off_row = settings_add_row(LV_SYMBOL_POWER, "Bildschirm aus",
                                         "Nach Untaetigkeit abschalten");
    screen_off_dd = lv_dropdown_create(off_row);
    lv_dropdown_set_options(screen_off_dd, screen_off_options);
    lv_dropdown_set_selected(screen_off_dd, screen_off_idx);
    lv_obj_set_width(screen_off_dd, 150);
    lv_obj_add_event_cb(screen_off_dd, screen_off_dd_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    lv_obj_t *saver_row = settings_add_row(LV_SYMBOL_EYE_OPEN, "Bildschirmschoner",
                                           "Statt abschalten die Uhr zeigen");
    saver_dd = lv_dropdown_create(saver_row);
    lv_dropdown_set_options(saver_dd, saver_options);
    lv_dropdown_set_selected(saver_dd, saver_idx);
    lv_obj_set_width(saver_dd, 150);
    lv_obj_add_event_cb(saver_dd, saver_dd_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    brightness_slider = settings_add_slider_row(LV_SYMBOL_SETTINGS, "Helligkeit",
                                                0, 100, brightness,
                                                brightness_cb, &brightness_value_lbl);
    lv_label_set_text_fmt(brightness_value_lbl, "%d%%", 20 + brightness * 80 / 100);

    // --- Bambuddy-Verbindung ---
    settings_add_section("BAMBUDDY");

    settings_add_text_row(LV_SYMBOL_HOME, "Server-URL",
                          bambuddy_configured_base_url, bambuddy_set_base_url, false,
                          false);

